app/views/collections/show.html.erb


<% Jewel.where(collection_id: @collection.id). each do |jewel| %>
---
SELECT "jewels".* FROM "jewels" WHERE "jewels"."collection_id" = ?  [["collection_id", "1"]]