app/controllers/jewels_controller.rb

  def index
    @jewels = Jewel.all
---
SELECT "jewels".* FROM "jewels"

  def flop
    jewel = Jewel.find(params[:id])
    jewel.available = "No"
    jewel.save
---
SELECT  "jewels".* FROM "jewels" WHERE "jewels"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "jewels" SET "available" = ?, "updated_at" = ? WHERE "jewels"."id" = ?  [["available", "f"], ["updated_at", "2019-04-08 16:37:17.639842"], ["id", 1]]

  def sell
    jewel = Jewel.find(params[:id])
    jewel.available = "Yes"
    jewel.save
---
SELECT  "jewels".* FROM "jewels" WHERE "jewels"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "jewels" SET "available" = ?, "updated_at" = ? WHERE "jewels"."id" = ?  [["available", "Yes"], ["updated_at", "2019-04-08 21:05:00.329786"], ["id", 1]]

  def new
    @jewel = Jewel.new
    @collections = Collection.all.map{|c| [c.name, c.id]}
---
SELECT "collections".* FROM "collections"

  def edit
    @collections = Collection.all.map{|c| [c.name, c.id]}
---
SELECT "collections".* FROM "collections"

  def create
    @jewel = Jewel.new(jewel_params)
    @jewel.collection_id = params[:collection_id]

    respond_to do |format|
      if @jewel.save
---
INSERT INTO "jewels" ("image", "name", "description", "price", "available", "collection_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @jewel.update(jewel_params)
---
UPDATE "jewels" SET "description" = ?, "updated_at" = ? WHERE "jewels"."id" = ?  [["description", "A orange stone that controls the soul."], ["updated_at", "2019-04-08 23:46:23.291983"], ["id", 6]]

  def destroy
    @jewel.destroy
---
DELETE FROM "jewels" WHERE "jewels"."id" = ?  [["id", 7]]

    def set_jewel
      @jewel = Jewel.find(params[:id])
---
SELECT  "jewels".* FROM "jewels" WHERE "jewels"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]