app/views/jewels/index.html.erb

        <td><%= jewel.available %></td>
        <td><%= link_to Collection.find(jewel.collection_id).name  %></td>
---
SELECT  "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]